InformationRegisters/ЛБ_СогласияНаИнформирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СогласияНаИнформирование</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыСогласийНаИнформирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИзменениеКонтактныхДанныхКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИзменениеКонтактныхДанныхКлиента</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыИзмененийКонтактныхДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительныйПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛицаПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдресПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдресПредыдущий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_Заместители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_Заместители</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СотрудникКогоЗамещают</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеЗамещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыСогласийНаИнформирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыСогласийНаИнформирование</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнуто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыИзмененийКонтактныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыИзмененийКонтактныхДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изменены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзменения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЛБ_СогласияНаИнформированиеСервер/Ext/Module.bsl
Функция ЗаключитьСогласиеНаИнформированиеСервер(Клиент) Экспорт
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаИнформирование.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.ДатаОкончания = ДобавитьМесяц(МенеджерЗаписи.Период, 60);
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Заключено;
		МенеджерЗаписи.Основание     = "Заключено Согласие на информирование";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	Возврат РезультатЗаключения;
КонецФункции // ЗаключитьЭДОСервер()

Функция НаличиеДействующегоСогласия(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Статус = Выборка.Статус;
		Если Статус = Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Заключено Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции 

Функция НаличиеСогласия(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(
		|			&ТекущаяДата,
		|			Клиент = &Клиент
		|				И Статус = &Статус
		|				И НЕ Ошибочное) КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Заключено);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

Функция НаличиеОтзыва(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Статус КАК Статус,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Ошибочное КАК Ошибочное
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(
		|			&ТекущаяДата,
		|			Клиент = &Клиент
		|				И Статус = &Статус
		|				И НЕ Ошибочное) КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Расторгнуто);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

Функция ОтозватьСогласиеНаИнформирование(Клиент) Экспорт
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаИнформирование.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Расторгнуто;
		МенеджерЗаписи.Основание     = "Отозвано Согласие на информирование";
		МенеджерЗаписи.Записать();
		РезультатОтзыва = Истина;
	Исключение
		РезультатОтзыва = Ложь;
	КонецПопытки;
	Возврат РезультатОтзыва;
КонецФункции

Процедура ОтозватьСогласиеНаИнформированиеПослеОтзываПД(Клиент, Комментарий = Неопределено) Экспорт
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаИнформирование.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Расторгнуто;
		Если Комментарий <> Неопределено Тогда
			МенеджерЗаписи.Основание = "Согласие на информирование прекращено (отзыв согласия на обработку ПДн (ЦО))";
			МенеджерЗаписи.Ломбард   = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
		Иначе
			МенеджерЗаписи.Основание = "Согласие на информирование прекращено (отзыв согласия на обработку ПДн)";
			МенеджерЗаписи.Ломбард   = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		КонецЕсли;
		МенеджерЗаписи.Записать();
		РезультатОтзыва = Истина;
	Исключение	
	КонецПопытки;
КонецПроцедуры

Процедура УдалитьЗаключениеСогласияСервер(Клиент, СтруктураСогласия) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЛБ_СогласияНаИнформирование.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(СтруктураСогласия.Период);
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Запись.Ошибочное = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаИнформирование.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСогласийНаИнформирование.НеЗаключено;
		МенеджерЗаписи.Основание     = "Удалено Согласие на информирование";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	//Возврат РезультатЗаключения;
КонецПроцедуры

Процедура ОтменитьИзменениеКонтактныхДанныхСервер(Клиент, Период) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Запись.Ошибочное = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДатаСеанса();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыИзмененийКонтактныхДанных.ОтменаИзменения;
		МенеджерЗаписи.Основание     = "Отменено изменение контактных данных от " + Строка(Период);
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьОтзывСогласияСервер(Клиент, СтруктураСогласия) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЛБ_СогласияНаИнформирование.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(СтруктураСогласия.Период);
	НаборЗаписей.Отбор.Клиент.Установить(Клиент);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Запись.Ошибочное = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;	
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_СогласияНаИнформирование.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период        = ТекущаяДата();
		МенеджерЗаписи.Клиент        = Клиент;
		МенеджерЗаписи.Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Статус        = Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Заключено;
		МенеджерЗаписи.Основание     = "Удален отзыв Согласия на информирование";
		МенеджерЗаписи.Записать();
		РезультатЗаключения = Истина;
	Исключение
		РезультатЗаключения = Ложь;
	КонецПопытки;
	//Возврат РезультатЗаключения;
КонецПроцедуры // РасторгнутьЭДОСервер()

Функция ПоследнийСтатусСогласия(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Статус КАК Статус,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Период КАК Период,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(
		|			&ТекущаяДата,
		|			Клиент = &Клиент
		|				И НЕ Ошибочное
		|				И Основание <> ""Удалено Согласие на информирование""
		|				И Основание <> ""Удален отзыв Согласия на информирование"") КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураВыборки = Новый Структура;
	Если Выборка.Следующий() Тогда
		СтруктураВыборки.Вставить("Статус",        Выборка.Статус);
		СтруктураВыборки.Вставить("Период",        Выборка.Период);
		СтруктураВыборки.Вставить("Ответственный", Выборка.Ответственный);
	КонецЕсли;
	Возврат СтруктураВыборки;

КонецФункции

Функция ПоследнееИзменениеКонтактныхДанных(Клиент) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Статус КАК Статус,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Период КАК Период,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СрезПоследних(
		|			&ТекущаяДата,
		|			Клиент = &Клиент
		|				И Статус = &Статус
		|				И НЕ Ошибочное) КАК ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыИзмененийКонтактныхДанных.Изменены);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураВыборки = Новый Структура;
	Если Выборка.Следующий() Тогда
		СтруктураВыборки.Вставить("Статус",        Выборка.Статус);
		СтруктураВыборки.Вставить("Период",        Выборка.Период);
		СтруктураВыборки.Вставить("Ответственный", Выборка.Ответственный);
	КонецЕсли;
	Возврат СтруктураВыборки;

КонецФункции

Функция ПоследниеКонтактныеДанные(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ТелефонПредыдущий КАК ТелефонПредыдущий,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ТелефонДополнительныйПредыдущий КАК ТелефонДополнительныйПредыдущий,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.EmailПредыдущий КАК EmailПредыдущий,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.КонтактноеЛицоПредыдущий КАК КонтактноеЛицоПредыдущий,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ТелефонКонтактногоЛицаПредыдущий КАК ТелефонКонтактногоЛицаПредыдущий,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ФактическийАдресПредыдущий КАК ФактическийАдресПредыдущий,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ПочтовыйАдресПредыдущий КАК ПочтовыйАдресПредыдущий
		|ИЗ
		|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураВыборки = Новый Структура;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ТелефонПредыдущий) Тогда
			СтруктураВыборки.Вставить("Телефон",              Выборка.ТелефонПредыдущий);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТелефонДополнительныйПредыдущий) Тогда
			СтруктураВыборки.Вставить("ТелефонДополнительный", Выборка.ТелефонДополнительныйПредыдущий);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.EmailПредыдущий) Тогда
			СтруктураВыборки.Вставить("Email",                 Выборка.EmailПредыдущий);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.КонтактноеЛицоПредыдущий) Тогда
			СтруктураВыборки.Вставить("КонтактноеЛицо",        Выборка.КонтактноеЛицоПредыдущий);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТелефонКонтактногоЛицаПредыдущий) Тогда
			СтруктураВыборки.Вставить("ТелефонКонтактногоЛица",Выборка.ТелефонКонтактногоЛицаПредыдущий);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ФактическийАдресПредыдущий) Тогда
			СтруктураВыборки.Вставить("ФактическийАдрес",      Выборка.ФактическийАдресПредыдущий);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ПочтовыйАдресПредыдущий) Тогда
			СтруктураВыборки.Вставить("ПочтовыйАдрес",         Выборка.ПочтовыйАдресПредыдущий);
		КонецЕсли;	
	КонецЕсли;
	Возврат СтруктураВыборки;


КонецФункции

Процедура ЗаписатьИзмененияКонтактныхДанных(Клиент, КонтактныеДанные) Экспорт
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период                 = КонтактныеДанные.Период;
		МенеджерЗаписи.Клиент                 = Клиент;
		МенеджерЗаписи.Ломбард                = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		Если КонтактныеДанные.Свойство("Телефон") Тогда
		МенеджерЗаписи.Телефон                = КонтактныеДанные.Телефон;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("ТелефонДополнительный") Тогда
		МенеджерЗаписи.ТелефонДополнительный  = КонтактныеДанные.ТелефонДополнительный;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("Email") Тогда
		МенеджерЗаписи.Email                  = КонтактныеДанные.Email;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("КонтактноеЛицо") Тогда
		МенеджерЗаписи.КонтактноеЛицо         = КонтактныеДанные.КонтактноеЛицо;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("ТелефонКонтактногоЛица") Тогда
		МенеджерЗаписи.ТелефонКонтактногоЛица = КонтактныеДанные.ТелефонКонтактногоЛица;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("ФактическийАдрес") Тогда
		МенеджерЗаписи.ФактическийАдрес       = КонтактныеДанные.ФактическийАдрес;
		КонецЕсли;
		Если КонтактныеДанные.Свойство("ПочтовыйАдрес") Тогда
		МенеджерЗаписи.ПочтовыйАдрес          = КонтактныеДанные.ПочтовыйАдрес;
		КонецЕсли;
		МенеджерЗаписи.Ответственный          = ПараметрыСеанса.ТекущийСотрудник;
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция ПроверкаРоли_ЛБ_СотрудникЦО() Экспорт 
	//Если Пользователи.РолиДоступны("ЛБ_СотрудникЦО") Тогда 
	//	Возврат Истина;
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
	
	Если Не ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ТекущийСотрудникСеанса() Экспорт 
	Возврат ПараметрыСеанса.ТекущийСотрудник;
КонецФункции

#Область ДанныеДляПечати

Функция ПолучитьДанныеДляПечатиСогласияНаИнформирование(Клиент, ИзФормыПечати = Ложь) Экспорт
	
	Структура = Новый Структура();
	
	Если ИзФормыПечати Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Период КАК Период,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(
		|			&Дата,
		|			Клиент = &Клиент
		|				И Статус = &Статус
		|				И НЕ Ошибочное
		|				И Основание = ""Заключено Согласие на информирование"") КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Заключено);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСреза     = Выборка.Период;
		Ломбард       = Выборка.Ломбард;
		Ответственный = Выборка.Ответственный;
	КонецЕсли;
	
	Иначе
		ДатаСреза     = ТекущаяДата();
		Ломбард       = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		Если Не ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		КонецЕсли;
	КонецЕсли;	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ломбард.ПолучитьОбъект(),,ДатаСреза);
	СтруктураАдреса = фПрочитатьJSON(Ломбард.КонтактнаяИнформация[0].Значение);
	Структура.Вставить("Город",                         "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, ""));
	Структура.Вставить("Дата",                          ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));
	Структура.Вставить("АдресОрганизации",              ?(ЗначениеЗаполнено(СведенияОбОрганизации.АдресОрганизации),
	                                                    СведенияОбОрганизации.АдресОрганизации, ""));
	Структура.Вставить("ИНН",                           ?(ЗначениеЗаполнено(Организация.ИНН), Организация.ИНН, ""));
	Структура.Вставить("ОГРН",                          ?(ЗначениеЗаполнено(Организация.ОГРН), Организация.ОГРН, ""));
	//Структура.Вставить("ПочтаОрганизации",              СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации);
	//Структура.Вставить("ТелефонОрганизации",            СведенияОбОрганизации.ТелефонОрганизации);
	
	Структура.Вставить("Ломбард",                       ?(ЗначениеЗаполнено(Ломбард), Строка(Ломбард), ""));
	Структура.Вставить("АдресЛомбарда",                 СтруктураАдреса.value);
	Структура.Вставить("ТелефонЛомбарда",               "");
	
	ДолжностьОтветственного                             = ДолжностьОтветственного(Ответственный, ДатаСреза);
	СклонениеДолжностиОтветственного                    = ПолучитьСклоненияСтроки(Строка(ДолжностьОтветственного), , "ПД=Родительный");
	Структура.Вставить("ДолжностьОтветственногоВПадеже",     ?(ЗначениеЗаполнено(СклонениеДолжностиОтветственного), 
	                                                    НРег(?(СклонениеДолжностиОтветственного.Количество() > 0, СклонениеДолжностиОтветственного[0], "")), ""));
	Структура.Вставить("ДолжностьОтветственного",       ?(ЗначениеЗаполнено(ДолжностьОтветственного), Строка(ДолжностьОтветственного), ""));
	ФИООтветственного                                   = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		Если ФИООтветственного.Количество() > 2 Тогда 
			ФамилияОтветственного  = ФИООтветственного[0]; 
			ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
		Иначе
			ФамилияОтветственного  = ФИООтветственного[0]; 
			ИнициалыОтветственного = Лев(ФИООтветственного[1], 3) + ".";
		КонецЕсли;
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	СклонениеФамилииОтветственного                      = ПолучитьСклоненияСтроки(ФамилияОтветственного, , "ПД=Родительный");
	ФамилияОтветственногоВПадеже                        = ?(СклонениеФамилииОтветственного.Количество() > 0, СклонениеФамилииОтветственного[0], "");
	
	Структура.Вставить("ФамилияИнициалыОтветственногоВПадеже",ФамилияОтветственногоВПадеже + " " + ИнициалыОтветственного);
	Структура.Вставить("ФИООтветственного", ФамилияОтветственного + " " + ИнициалыОтветственного);
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("ТелефонКлиента",                ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Телефон), 
	                                                    КонтактнаяИнформацияКлиента.Телефон, ""));
	Структура.Вставить("ПочтаКлиента",                  ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Email),
	                                                                КонтактнаяИнформацияКлиента.Email, "нет"));
	Структура.Вставить("ФамилияИнициалыКлиента",        ДанныеКлиента.Фамилия + " " + Лев(ДанныеКлиента.Имя, 1) + "." + Лев(ДанныеКлиента.Отчество, 1) + ".");
	
	Возврат Структура;
КонецФункции

Функция ПолучитьДанныеДляПечатиОтзываСогласияНаИнформирование(Клиент, ИзФормыПечати = Ложь) Экспорт
	
	Структура = Новый Структура();
	
	Если ИзФормыПечати Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Период КАК Период,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(
		|			&Дата,
		|			Клиент = &Клиент
		|				И Статус = &Статус
		|				И НЕ Ошибочное
		|				И Основание = ""Отозвано Согласие на информирование"") КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Расторгнуто);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСреза     = Выборка.Период;
		Ответственный = Выборка.Ответственный;	
	КонецЕсли;	
	
	Иначе
		ДатаСреза     = ТекущаяДата();
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	
	ЗапросДатаЗаключения = Новый Запрос;
	ЗапросДатаЗаключения.Текст = "ВЫБРАТЬ
	                             |	ЛБ_СогласияНаИнформированиеСрезПоследних.Период КАК Период,
	                             |	ЛБ_СогласияНаИнформированиеСрезПоследних.Ответственный КАК Ответственный
	                             |ИЗ
	                             |	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(
	                             |			&Дата,
	                             |			Клиент = &Клиент
	                             |				И Статус = &Статус
	                             |				И НЕ Ошибочное) КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	ЗапросДатаЗаключения.УстановитьПараметр("Клиент", Клиент);
	ЗапросДатаЗаключения.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Заключено);
	ЗапросДатаЗаключения.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = ЗапросДатаЗаключения.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		ДатаЗаключения = Выборка.Период;
	КонецЕсли;
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	Структура.Вставить("ДатаЗаключения",                ?(ЗначениеЗаполнено(ДатаЗаключения), Формат(ДатаЗаключения, "ДЛФ=D"), ""));
	
	Структура.Вставить("Дата",                          ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));	
	ДолжностьОтветственного                             = ДолжностьОтветственного(Ответственный, ДатаСреза);

	Структура.Вставить("ДолжностьОтветственного",       ?(ЗначениеЗаполнено(ДолжностьОтветственного), Строка(ДолжностьОтветственного), ""));
	
	ФИООтветственного                                   = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли;
	
	Структура.Вставить("ФИООтветственного",             ФамилияОтветственного + " " + ИнициалыОтветственного);
	
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("ТелефонКлиента",                ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Телефон), 
	                                                    КонтактнаяИнформацияКлиента.Телефон, ""));
	Структура.Вставить("ПочтаКлиента",                  ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.Email),
	                                                                КонтактнаяИнформацияКлиента.Email, "нет"));
	Структура.Вставить("ФамилияИнициалыКлиента",        ДанныеКлиента.Фамилия + " " + Лев(ДанныеКлиента.Имя, 1) + "." + Лев(ДанныеКлиента.Отчество, 1) + ".");
	
	Возврат Структура;
КонецФункции

Функция ПолучитьДанныеДляПечатиИзменениеКонтактныхДанных(Клиент, ИзФормыПечати = Ложь, СтруктураРеквизитовКонтактныеДанныеДляПечати = Неопределено) Экспорт
	
	Структура = Новый Структура();
	
	Если ИзФормыПечати Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Период КАК Период,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Телефон КАК Телефон,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ТелефонДополнительный КАК ТелефонДополнительный,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.Email КАК Email,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
		|	ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес
		|ИЗ
		|	РегистрСведений.ЛБ_ИзменениеКонтактныхДанныхКлиента.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ЛБ_ИзменениеКонтактныхДанныхКлиентаСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		ДатаСреза = Выборка.Период;
		СтруктураРеквизитовКонтактныеДанныеДляПечати = Новый Структура;
		Если ЗначениеЗаполнено(Выборка.Телефон) Тогда
			СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("Телефон", Выборка.Телефон);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТелефонДополнительный) Тогда
			СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ТелефонДополнительный", Выборка.ТелефонДополнительный);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Email) Тогда
			СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("Email", Выборка.Email);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.КонтактноеЛицо) Тогда
			СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("КонтактноеЛицо", Выборка.КонтактноеЛицо);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТелефонКонтактногоЛица) Тогда
			СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ТелефонКонтактногоЛица", Выборка.ТелефонКонтактногоЛица);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ФактическийАдрес) Тогда
			СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ФактическийАдрес", Выборка.ФактическийАдрес);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда
			СтруктураРеквизитовКонтактныеДанныеДляПечати.Вставить("ПочтовыйАдрес", Выборка.ПочтовыйАдрес);
		КонецЕсли;
	КонецЕсли;	

    Иначе
	ДатаСреза     = ТекущаяДата();
	КонецЕсли;
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Поля = "НаименованиеПолное, АдресОрганизацииФакт, ТелефонОрганизации, АдресЭлектроннойПочтыОрганизации";
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Организация, Поля, ДатаСреза);	
	
	Структура.Вставить("Дата",                          ?(ЗначениеЗаполнено(ДатаСреза), Формат(ДатаСреза, "ДЛФ=D"), ""));
	
	Структура.Вставить("НаименованиеОрганизации",       ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечати),
	                                                    СведенияОбОрганизации.НаименованиеДляПечати, ""));
	ДанныеКлиента                                       = ДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("Клиент",                        ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество);													
	//Структура.Вставить("Клиент",                        ?(ЗначениеЗаполнено(Клиент), Строка(Клиент), ""));
	ПаспортныеДанныеКлиента                             = ПаспортныеДанныеКлиента(Клиент, ДатаСреза);
	Структура.Вставить("ДатаРожденияКлиента",           Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("ПаспортныеДанныеКлиента",       ?(ЗначениеЗаполнено(ПаспортныеДанныеКлиента.ПаспортныеДанные), ПаспортныеДанныеКлиента.ПаспортныеДанные, ""));
	КонтактнаяИнформацияКлиента                         = КонтактнаяИнформацияКлиента(Клиент, ДатаСреза);
	Структура.Вставить("МестоЖительстваКлиента",        ?(ЗначениеЗаполнено(КонтактнаяИнформацияКлиента.АдресПоПрописке), 
	                                                    КонтактнаяИнформацияКлиента.АдресПоПрописке, ""));
	Структура.Вставить("Телефон",				        ?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("Телефон"), 
	                                                    СтруктураРеквизитовКонтактныеДанныеДляПечати.Телефон, Символы.НПП));
	Структура.Вставить("ТелефонДополнительный",			?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("ТелефонДополнительный"), 
	                                                    СтруктураРеквизитовКонтактныеДанныеДляПечати.ТелефонДополнительный, Символы.НПП));
	Структура.Вставить("Email",				            ?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("Email"), 
	                                                    СтруктураРеквизитовКонтактныеДанныеДляПечати.Email, Символы.НПП));
	Структура.Вставить("КонтактноеЛицо",				?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("КонтактноеЛицо"), 
	                                                    СтруктураРеквизитовКонтактныеДанныеДляПечати.КонтактноеЛицо, Символы.НПП));
	Структура.Вставить("ТелефонКонтактногоЛица",		?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("ТелефонКонтактногоЛица"), 
	                                                    СтруктураРеквизитовКонтактныеДанныеДляПечати.ТелефонКонтактногоЛица, Символы.НПП));
	Структура.Вставить("ФактическийАдрес",				?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("ФактическийАдрес"), 
	                                                    СтруктураРеквизитовКонтактныеДанныеДляПечати.ФактическийАдрес, Символы.НПП));
	Структура.Вставить("ПочтовыйАдрес",				    ?(СтруктураРеквизитовКонтактныеДанныеДляПечати.Свойство("ПочтовыйАдрес"), 
	                                                    СтруктураРеквизитовКонтактныеДанныеДляПечати.ПочтовыйАдрес, Символы.НПП));
	Возврат Структура;
КонецФункции 

Функция ПаспортныеДанныеКлиента(Залогодатель, Дата, ДокументСПрописнойБуквы = Ложь)
	
	Результат = Новый Структура("ПаспортныеДанные, ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения", "", "", "", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента.Представление КАК ВидДокумента,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК Серия,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК Номер,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК КемВыдан,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА """"
		|		ИНАЧЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи
		|	КОНЕЦ КАК ДатаВыдачи,
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК КодПодразделения
		|ИЗ
		|	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя.Владелец = &Залогодатель) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		|ГДЕ
		|	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя = &ДУЛ
		|	И НЕ ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНеДействителен
		|	И ЛБ_ДокументыЗалогодателейСрезПоследних.ОсновнойДУЛ";
	
	Запрос.УстановитьПараметр("ДУЛ", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		ВидДокументаВыборка = ?(ДокументСПрописнойБуквы, СтрШаблон("%1%2", НРег(Лев(Выборка.ВидДокумента, 1)), Сред(Выборка.ВидДокумента, 2)), Выборка.ВидДокумента);
		
		ВидДокумента     = ?(ПустаяСтрока(ВидДокументаВыборка),      "", СтрШаблон(" %1:",                    ВидДокументаВыборка));
		Серия            = ?(ПустаяСтрока(Выборка.Серия),            "", СтрШаблон(" серия %1",              Выборка.Серия));
		Номер            = ?(ПустаяСтрока(Выборка.Номер),            "", СтрШаблон(" номер %1,",              Выборка.Номер));
		КемВыдан         = ?(ПустаяСтрока(Выборка.КемВыдан),         "", СтрШаблон(" выдан: %1,",             Выборка.КемВыдан));
		ДатаВыдачи       = ?(ПустаяСтрока(Выборка.ДатаВыдачи),       "", СтрШаблон(" дата выдачи: %1,",       Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")));
		КодПодразделения = ?(ПустаяСтрока(Выборка.КодПодразделения), "", СтрШаблон(" код подразделения: %1,", Выборка.КодПодразделения)); 
		
		Результат.Вставить("ПаспортныеДанные", СтрШаблон("%1%2%3%4%5%6", ВидДокумента, Серия, Номер, КемВыдан, ДатаВыдачи, КодПодразделения));
		Результат.Вставить("ВидДокумента",     Выборка.ВидДокумента);
		Результат.Вставить("Серия",            Выборка.Серия);
		Результат.Вставить("Номер",            Выборка.Номер);
		Результат.Вставить("КемВыдан",         Выборка.КемВыдан);
		Результат.Вставить("ДатаВыдачи",       Выборка.ДатаВыдачи);
		Результат.Вставить("КодПодразделения", Выборка.КодПодразделения);
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ДолжностьОтветственного(Сотрудник, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Должность;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция КонтактнаяИнформацияКлиента(Залогодатель, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура;
        Структура.Вставить("Телефон",          Выборка.Телефон);
        Структура.Вставить("Email",            Выборка.Email);
        Структура.Вставить("АдресПоПрописке",  Выборка.АдресПоПрописке);
        Структура.Вставить("ФактическийАдрес", Выборка.ФактическийАдрес);
		Возврат Структура;
	Иначе
		Структура = Новый Структура;
        Структура.Вставить("Телефон",          "");
        Структура.Вставить("Email",            "");
        Структура.Вставить("АдресПоПрописке",  "");
        Структура.Вставить("ФактическийАдрес", "");
		Возврат Структура;
    КонецЕсли;		
КонецФункции

Функция ДанныеКлиента(Залогодатель, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура;
        Структура.Вставить("Фамилия",      Выборка.Фамилия);
        Структура.Вставить("Имя",          Выборка.Имя);
        Структура.Вставить("Отчество",     Выборка.Отчество);
        Структура.Вставить("ДатаРождения", Выборка.ДатаРождения);
		Возврат Структура;
	Иначе
		Структура = Новый Структура;
        Структура.Вставить("Фамилия",      "");
        Структура.Вставить("Имя",          "");
        Структура.Вставить("Отчество",     "");
        Структура.Вставить("ДатаРождения", "");
		Возврат Структура;
    КонецЕсли;		
КонецФункции

Функция ПолучитьМакетСервер(ИмяМакета)
	
	Макет = ПолучитьОбщийМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции // ПолучитьМакетСервер(ИмяМакета)()

Функция ФормированиеДоговораПоШаблону(ИмяМакета) Экспорт
	
	АктивныйДокумент = ПолучитьМакетСервер(ИмяМакета);
	
	УИД = Новый УникальныйИдентификатор();
	Адрес = ПоместитьВоВременноеХранилище(АктивныйДокумент, УИД);
	
	Возврат Адрес;
		
КонецФункции

Функция ПечатьОтчетОСогласияхНаИнформированиеСервер(ПараметрыОтчетаОСогласияхНаИнформирование) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетОСогласияхНаИнформирование";
	
	//+МАН 02.12.25 Добавил параметры
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//-МАН
	
	Макет = ПолучитьОбщийМакет("ЛБ_ОтчетОСогласияхНаИнформирование");
	
	ОбластьШапка   = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблица = Макет.ПолучитьОбласть("ОбластьТаблица");
	ОбластьПодвал  = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.Организация = ПараметрыОтчетаОСогласияхНаИнформирование.Организация.НаименованиеСокращенное;
	ОбластьШапка.Параметры.Ломбард = ПараметрыОтчетаОСогласияхНаИнформирование.Ломбард;
	
	АдресЛомбарда = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыОтчетаОСогласияхНаИнформирование.Ломбард.ПолучитьОбъект(),,ПараметрыОтчетаОСогласияхНаИнформирование.НачалоПериода);
	СтруктураАдреса = фПрочитатьJSON(ПараметрыОтчетаОСогласияхНаИнформирование.Ломбард.КонтактнаяИнформация[0].Значение);
	ОбластьШапка.Параметры.Город = "г. " + ?(СтруктураАдреса.Свойство("city"), СтруктураАдреса.city, "");
	
	Если ПараметрыОтчетаОСогласияхНаИнформирование.НачалоПериода = ПараметрыОтчетаОСогласияхНаИнформирование.КонецПериода Тогда
		ВыводЗаПериод = Ложь;
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчетаОСогласияхНаИнформирование.НачалоПериода, "ДЛФ=DD");
	Иначе
		ВыводЗаПериод = Истина;
		ОбластьШапка.Параметры.Период = Формат(ПараметрыОтчетаОСогласияхНаИнформирование.НачалоПериода, "ДЛФ=DD") + "-" + Формат(ПараметрыОтчетаОСогласияхНаИнформирование.КонецПериода, "ДЛФ=DD");
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформирование.Клиент КАК Клиент,
		|	ЛБ_СогласияНаИнформирование.Клиент.ДатаРождения КАК КлиентДатаРождения,
		|	ЛБ_СогласияНаИнформирование.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ЛБ_СогласияНаИнформирование.Статус = &Заключено
		|			ТОГДА ""Согласие на информирование""
		|		КОГДА ЛБ_СогласияНаИнформирование.Основание = ""Согласие на информирование прекращено (отзыв согласия на обработку ПДн)""
		|			ТОГДА ""Отзыв согласия на информирование (ПДн)""
		|		ИНАЧЕ ""Заявление об отзыве согласия на информирование""
		|	КОНЕЦ КАК Вид,
		|	ЛБ_СогласияНаИнформирование.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТСогласияНаИнформирование
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование КАК ЛБ_СогласияНаИнформирование
		|ГДЕ
		|	ЛБ_СогласияНаИнформирование.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЛБ_СогласияНаИнформирование.Ломбард = &Ломбард
		|	И ЛБ_СогласияНаИнформирование.Основание <> ""Удалено Согласие на информирование""
		|	И ЛБ_СогласияНаИнформирование.Основание <> ""Удален отзыв Согласия на информирование""
		|   И ЛБ_СогласияНаИнформирование.Основание <> ""Согласие на информирование прекращено (отзыв согласия на обработку ПДн (ЦО))""
		|	И НЕ ЛБ_СогласияНаИнформирование.Ошибочное
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСогласияНаИнформирование.Клиент КАК Клиент,
		|	ВТСогласияНаИнформирование.КлиентДатаРождения КАК ДатаРождения,
		|	ВТСогласияНаИнформирование.Период КАК Период,
		|	ВТСогласияНаИнформирование.Вид КАК Вид,
		|	ВТСогласияНаИнформирование.Ответственный КАК Ответственный
		|ИЗ
		|	ВТСогласияНаИнформирование КАК ВТСогласияНаИнформирование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Заключено", Перечисления.ЛБ_СтатусыСогласийНаИнформирование.Заключено);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыОтчетаОСогласияхНаИнформирование.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчетаОСогласияхНаИнформирование.КонецПериода));
	Запрос.УстановитьПараметр("Ломбард", ПараметрыОтчетаОСогласияхНаИнформирование.Ломбард);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	н = 1;
	Соглашения = 0;
	Расторжения = 0;
	РасторженияПД = 0;
	Изменения = 0;
	Пока Выборка.Следующий() Цикл
		ОбластьТаблица.Параметры.Заполнить(Выборка);
		
		ФИООтветственного          = СтрРазделить(Строка(Выборка.Ответственный), " ");
		
		Если ФИООтветственного.Количество() > 0 Тогда
			ФамилияОтветственного  = ФИООтветственного[0]; 
			ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
		Иначе
			ФамилияОтветственного  = ""; 
			ИнициалыОтветственного = "";
		КонецЕсли;
		
		ОбластьТаблица.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
		
		ДанныеКлиента = ДанныеКлиента(Выборка.Клиент, Выборка.Период);
		ОбластьТаблица.Параметры.Клиент = ДанныеКлиента.Фамилия + " " +  ДанныеКлиента.Имя + " " + ДанныеКлиента.Отчество;
		ОбластьТаблица.Параметры.ДатаРождения = Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьТаблица.Параметры.Номер = н;
		н = н +1;
		Если Выборка.Вид = "Согласие на информирование" Тогда
			Соглашения = Соглашения + 1;
		ИначеЕсли Выборка.Вид = "Заявление об отзыве согласия на информирование" Тогда
			Расторжения = Расторжения + 1;
		ИначеЕсли Выборка.Вид = "Отзыв согласия на информирование (ПДн)" Тогда
			РасторженияПД = РасторженияПД + 1;
		КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьТаблица);	
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Согласия  = Соглашения;
	ОбластьПодвал.Параметры.Расторжения = Расторжения;
	ОбластьПодвал.Параметры.РасторженияПД = РасторженияПД;
	
	Ответственный              = ПараметрыСеанса.ТекущийСотрудник;
	
	ФИООтветственного          = СтрРазделить(Строка(Ответственный), " ");
	
	Если ФИООтветственного.Количество() > 0 Тогда
		ФамилияОтветственного  = ФИООтветственного[0]; 
		ИнициалыОтветственного = Лев(ФИООтветственного[1], 1) + "." + Лев(ФИООтветственного[2], 1) + ".";
	Иначе
		ФамилияОтветственного  = ""; 
		ИнициалыОтветственного = "";
	КонецЕсли; 
	
	ДолжностьОтветственного = ДолжностьОтветственного(Ответственный, ТекущаяДата());
	
	ОбластьПодвал.Параметры.ДолжностьОтветственного = ДолжностьОтветственного;
	ОбластьПодвал.Параметры.Ответственный = ФамилияОтветственного + " " + ИнициалыОтветственного;
	
	Если ВыводЗаПериод Тогда
	    ДанныеНачальника_Управляющего = ПолучитьНачальникаОтделения_Управляющего(ПараметрыОтчетаОСогласияхНаИнформирование.Ломбард, ТекущаяДата());
		ОбластьПодвал.Параметры.НачальникОтделения = ?(ДанныеНачальника_Управляющего.Свойство("Должность"), Строка(ДанныеНачальника_Управляющего.Должность), "") 
		+ "______________________" + "(" + ?(ДанныеНачальника_Управляющего.Свойство("Сотрудник"), Строка(ДанныеНачальника_Управляющего.Сотрудник), "") + ")";
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьНачальникаОтделения_Управляющего(Ломбард, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ПОМЕСТИТЬ ВТОтделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ПОМЕСТИТЬ ЛомбардыОтделения
		|ИЗ
		|	ВТОтделение КАК ВТОтделение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|		ПО ВТОтделение.Отделение = ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|			ТОГДА ""Начальник отделения ломбардов""
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|			ТОГДА ""Начальник отделения ломбардов""
		|		КОГДА ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда
		|			ТОГДА ""Управляющий ломбарда""
		|	КОНЕЦ КАК Должность
		|ИЗ
		|	ЛомбардыОтделения КАК ЛомбардыОтделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|		ПО ЛомбардыОтделения.Ломбард = ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение
		|ГДЕ
		|	(ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытияУвольнение";
	
	Запрос.УстановитьПараметр("ВидСобытияУвольнение", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураВозврата = Новый Структура;
	Если Выборка.Следующий() Тогда	
		Заместитель = ПроверкаЗаместителя(Выборка.Сотрудник, Дата);
		Если ЗначениеЗаполнено(Заместитель) Тогда
			СтруктураВозврата.Вставить("Сотрудник", Заместитель);
		Иначе
			СтруктураВозврата.Вставить("Сотрудник", Выборка.Сотрудник);
		КонецЕсли;
		СтруктураВозврата.Вставить("Должность", Выборка.Должность);
	КонецЕсли;
    Возврат СтруктураВозврата;
КонецФункции 

Функция ПроверкаЗаместителя(Сотрудник, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ЗаместителиСрезПоследних.Заместитель КАК Заместитель
		|ИЗ
		|	РегистрСведений.ЛБ_Заместители.СрезПоследних(
		|			&Дата,
		|			СотрудникКогоЗамещают = &Сотрудник
		|				И ОкончаниеЗамещения >= &Дата) КАК ЛБ_ЗаместителиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Заместитель;
	Иначе
		Возврат Справочники.ЛБ_Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПечатьСогласиеНаИнформированиеСервер(Клиент, ИзФормыПечати = Ложь) Экспорт 
	
	СтруктураДанных = ПолучитьДанныеДляПечатиСогласияНаИнформирование(Клиент, ИзФормыПечати);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
		
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СогласиеНаИнформирование";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_СогласиеНаИнформирование");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьТекст   = Макет.ПолучитьОбласть("ТекстСогласия");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ОбластьТекст.Параметры.Заполнить(СтруктураДанных);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьТекст);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	//ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
	//ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	//ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(СтруктураДанных.Ломбард) + 
	//"; " + Строка(СтруктураДанных.Клиент) + "; " + "Соглашение об ЭДО от " + Строка(СтруктураДанных.ДатаЗаключения);
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	//ОбластьШрифт = ТабличныйДокумент.Область("R39C1:R39C5");
	//ТабличныйДокумент.НижнийКолонтитул.Шрифт = ОбластьШрифт.Шрифт;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьЗаявлениеИзменениеКонтактныхДанных(Клиент, ИзФормыПечати, СтруктураРеквизитовКонтактныеДанныеДляПечати) Экспорт
	СтруктураДанных = ПолучитьДанныеДляПечатиИзменениеКонтактныхДанных(Клиент, ИзФормыПечати, СтруктураРеквизитовКонтактныеДанныеДляПечати);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
		
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИзменениеКонтактныхДанных";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ИзменениеКонтактныхДанных");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанные   = Макет.ПолучитьОбласть("Данные");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Если ЗначениеЗаполнено(СтруктураДанных.Телефон) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.Телефон;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.ТелефонДополнительный) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.ТелефонДополнительный;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.Email) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.Email;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.КонтактноеЛицо) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.КонтактноеЛицо;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.ТелефонКонтактногоЛица) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.ТелефонКонтактногоЛица;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтруктураДанных.ФактическийАдрес) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.ФактическийАдрес;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.ПочтовыйАдрес) Тогда
		ОбластьДанные.Параметры.КонтактныеДанные = СтруктураДанных.ПочтовыйАдрес;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЕсли;

	
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	//ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
	//ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
	//ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = Строка(СтруктураДанных.Ломбард) + 
	//"; " + Строка(СтруктураДанных.Клиент) + "; " + "Соглашение об ЭДО от " + Строка(СтруктураДанных.ДатаЗаключения);
	//ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
	//ТабличныйДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 8);
	//ТабличныйДокумент.НижнийКолонтитул.Шрифт.Масштаб = 8;
	//ТабличныйДокумент.НижнийКолонтитул.Шрифт.Полужирный = Ложь;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьОтзывСогласияНаИнформированиеСервер(Клиент, ИзФормыПечати = Ложь) Экспорт 
	
	СтруктураДанных = ПолучитьДанныеДляПечатиОтзываСогласияНаИнформирование(Клиент, ИзФормыПечати);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Защита = Истина;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтзывСогласияНаИнформирование";
	
	Макет = ПолучитьОбщийМакет("ЛБ_ПФ_ОтзывСогласияНаИнформирование_Клиент");
	
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
	ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция фПрочитатьJSON(ТекстJSON) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Структура = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
	Чтение.Закрыть();
	Возврат Структура;
КонецФункции

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	Результат = Новый Структура;

	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			Возврат Результат;
			ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);
		КонецЕсли;
	КонецЦикла;  
		
	Возврат Результат;
КонецФункции

Функция ЗаполнитьМассивИзОтветаJSON(Знач Чтение)
	Результат = Новый Массив;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта Тогда 
			Результат.Добавить(ЗаполнитьСтруктуруИзОтветаJSON(Чтение));
		ИначеЕсли Тип = ТипЗначенияJSON.КонецМассива Тогда 
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции

#КонецОбласти
